# InnerDiameter Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ConduitSize..::..InnerDiameter Property
ConduitSize Class See Also
---
Inner diameter
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public double InnerDiameter { get; }
```

Visual Basic
---
```text
Public ReadOnly Property InnerDiameter As Double
	Get
```

Visual C++
---
```text
public:
property double InnerDiameter {
	double get ();
}
```

# See Also
ConduitSize Class
Autodesk.Revit.DB.Electrical Namespace